"I have read and agree to the WPS Office License Agreement and the Privacy Policy." = "Ich habe die WPS Office-Lizenzvereinbarung und die Datenschutzrichtlinie gelesen und stimme diesen zu.";

"WPS Office License Agreement" = "WPS Office-Lizenzvereinbarung";

"Privacy Policy" = "Datenschutzrichtlinie";

"Download failed, please check the network" = "Download fehlgeschlagen, bitte überprüfen Sie Ihre Netzwerkverbindung.";

"manual install" = "Manuelle Installation";

"Retry" = "Wiederholen";

"Install Now" = "Jetzt installieren";

"Installation failed, please check if the system has enough memory space." = "Die Installation ist fehlgeschlagen. Bitte prüfen Sie, ob Ihr System über ausreichend Arbeitsspeicher verfügt.";

"Installation failed, please close the running WPS Office." = "Die Installation ist fehlgeschlagen. Bitte schließen Sie das laufende WPS Office.";

"Installing, please wait..." = "WPS Office wird heruntergeladen...";

"Language" = "Sprache";

"All-in-One OfficeSuite with PDFEditor. Now with AI" = "KI-gestützte Office- & PDF-Suite für alle";

"Cancel" = "Stornieren";

"Tip" = "Hinweis";

"Confirm" = "bestätigen";

"In accordance with relevant policy requirements, for a better experience with WPS Office services, please read and agree to the License Agreement and Privacy Policy." = "Um die Dienste von WPS Office optimal nutzen zu können, lesen und akzeptieren Sie bitte gemäß den geltenden Richtlinien die Lizenzvereinbarung und die Datenschutzrichtlinie.";

"License Agreement" = "Lizenzvereinbarung";

"Create infinite possibilities" = "Unendliche Möglichkeiten schaffen";

"Installing WPS Office" = "WPS Office wird installiert...";

"Before installing, please close the running WPS Office." = "Bitte schließen Sie vor der Installation das laufende WPS Office.";